var pary=[
	"8:00-9:35",
	"9:45-11:20",
	"11:30-13:05",
	"13:25-15:00",
	"15:10-16:45",
	"16:55-18:30",
	"18:40-20:00",
	"20:10-21:30",
];

var dni=[
	"Понедельник",
	"Вторник",
	"Среда",
	"Четверг",
	"Пятница",
	"Суббота",
];

var korpusa=[
	"1",
	"1а",
	"1б",
	"2",
	"3",
	"4",
	"5",
	"5а",
	"6",
	"7",
	"8",
	"9",
	"10",
];

var grpalias=[
/*	[/МАТ_1_2.1/g,"МАТ_1_2"],
	[/МАТ_2_2.1/g,"МАТ_2_2"],
	[/МАТ__4.1/g,"МАТ_4.1"],
	[/ПММ_1_ФИИТ_62/g,"ПММ_1_ФИИТ.62"],
	[/"ФИЗ_1_1"/g,"\"ФИЗ_1_1.1\",\"ФИЗ_1_1.2\""],
	[/"ФИЗ_1_2"/g,"\"ФИЗ_1_2.1\",\"ФИЗ_1_2.2\""],
	[/"ФИЗ_1_3"/g,"\"ФИЗ_1_3.1\",\"ФИЗ_1_3.2\""],
	[/"ФИЗ_1_5НТ"/g,"\"ФИЗ_1_5НТ.1\",\"ФИЗ_1_5НТ.2\""],
	[/"ФИЗ_1_6"/g,"\"ФИЗ_1_6.1\",\"ФИЗ_1_6.2\""],
	[/"ФИЗ_1_7"/g,"\"ФИЗ_1_7.1\",\"ФИЗ_1_7.2\""],
	[/"ФИЗ_1_8"/g,"\"ФИЗ_1_8.1\",\"ФИЗ_1_8.2\""],
*/
	[/"ФИЗ_2_1"/g,"\"ФИЗ_2_1.1\",\"ФИЗ_2_1.2\""],
	[/"ФИЗ_2_2"/g,"\"ФИЗ_2_2.1\",\"ФИЗ_2_2.2\""],
	[/"ФИЗ_2_3"/g,"\"ФИЗ_2_3.1\",\"ФИЗ_2_3.2\""],
	[/"ФИЗ_2_4"/g,"\"ФИЗ_2_4.1\",\"ФИЗ_2_4.2\""],
	[/"ФИЗ_2_5"/g,"\"ФИЗ_2_5.1\",\"ФИЗ_2_5.2\""],
	[/"ФИЗ_2_6"/g,"\"ФИЗ_2_6.1\",\"ФИЗ_2_6.2\""],
	[/"ФИЗ_2_7"/g,"\"ФИЗ_2_7.1\",\"ФИЗ_2_7.2\""],
	[/"ФИЗ_2_8\(ЯФиТ\)"/g,"\"ФИЗ_2_8(ЯФиТ).1\",\"ФИЗ_2_8(ЯФиТ).2\""],
/*
	[/"ФИЗ_3_ОПТ"/g,"\"ФИЗ_3_ОПТ.1\",\"ФИЗ_3_ОПТ.2\""],
	[/"ФИЗ_3_ЭЛ"/g,"\"ФИЗ_3_ЭЛ.1\",\"ФИЗ_3_ЭЛ.2\""],
	[/"ФИЗ_3_ФИС"/g,"\"ФИЗ_3_ФИС.1\",\"ФИЗ_3_ФИС.2\""],
	[/"ФИЗ_3_ИС"/g,"\"ФИЗ_3_ИС.1\",\"ФИЗ_3_ИС.2\""],
	[/"ФИЗ_3_ЯД\+МФ"/g,"\"ФИЗ_3_ЯД+МФ.1\",\"ФИЗ_3_ЯД+МФ.2\""],
	[/"ФИЗ_3_ЯФиТ"/g,"\"ФИЗ_3_ЯФиТ.1\",\"ФИЗ_3_ЯФиТ.2\""],
	[/"ФИЗ_3_КТ"/g,"\"ФИЗ_3_КТ.1\",\"ФИЗ_3_КТ.2\""],
	[/"ФИЗ_3_МЭ"/g,"\"ФИЗ_3_МЭ.1\",\"ФИЗ_3_МЭ.2\""],
	[/"ФИЗ_3_ФТТиНС"/g,"\"ФИЗ_3_ФТТиНС.1\",\"ФИЗ_3_ФТТиНС.2\""],
	[/"ФИЗ_4_ОПТ"/g,"\"ФИЗ_4_ОПТ.1\",\"ФИЗ_4_ОПТ.2\""],
	[/"ФИЗ_4_ЭЛ"/g,"\"ФИЗ_4_ЭЛ.1\",\"ФИЗ_4_ЭЛ.2\""],
	[/"ФИЗ_4_КТ"/g,"\"ФИЗ_4_КТ.1\",\"ФИЗ_4_КТ.2\""],
	[/"ФИЗ_4_ФТТиНС"/g,"\"ФИЗ_4_ФТТиНС.1\",\"ФИЗ_4_ФТТиНС.2\""],
	[/МАТ_1_4.2/g,""],
	[/МАТ_1_4.1/g,"МАТ_1_4"],
	[/"ПММ_1_ПИ.10"/g,"\"ПММ_1_ПИВЮР.10\""],
	* */
];

var conflicts=[];
conflicts[-1]=[];


