var pary=[
	"8:00-9:35",
	"9:45-11:20",
	"11:20-13:05",
	"13:25-15:00",
	"15:10-16:45",
	"16:55-18:30",
	"18:40-20:00",
	"20:10-21:30",
];

var dni=[
	"Понедельник",
	"Вторник",
	"Среда",
	"Четверг",
	"Пятница",
	"Суббота",
];

var korpusa=[
	"1",
	"1а",
	"1б",
	"2",
	"3",
	"4",
	"5",
	"5а",
	"6",
	"7",
	"8",
	"9",
	"10",
];

var base=[
	{den: 0, para: 1, chzn: 0, aud:["1_319"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3","МАТ_2_2","МАТ_2_3.1","МАТ_2_3.2","МАТ_2_3.3","МАТ_2_4.1","МАТ_2_4.2"], prep: ["Яреско"], predm: "Экономика"},
	{den: 0, para: 1, chzn: 1, aud:["1_325"], grp:["МАТ_2_1.3","МАТ_2_2"], prep: ["Яреско"], predm: "Экономика"},
	{den: 0, para: 2, chzn: 0, aud:["1а_480"], grp:["МАТ_2_1.1","МАТ_2_1.2"], prep: ["Яреско"], predm: "Экономика"},
	{den: 0, para: 2, chzn: 2, aud:["1_315"], grp:["МАТ_2_1.3","МАТ_2_2"], prep: ["Орешина"], predm: "Английский язык"},
	{den: 0, para: 3, chzn: 2, aud:["1_306"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3"], prep: ["Завгородний"], predm: "Технологии программирования"},
	{den: 0, para: 4, chzn: 2, aud:["1_Спортзал","2_Борц. зал"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3","МАТ_2_2","МАТ_2_3.1","МАТ_2_3.2","МАТ_2_3.3","МАТ_2_4.1","МАТ_2_4.2"], prep: ["Попов","Стрельникова"], predm: "Физкультура"},

	{den: 1, para: 2, chzn: 2, aud:["1_305"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3"], prep: ["Леженина"], predm: "Диф. ур-я"},
	{den: 1, para: 3, chzn: 2, aud:["1_305"], grp:["МАТ_2_1.1"], prep: ["Леженина"], predm: "Диф. ур-я"},
	{den: 1, para: 3, chzn: 2, aud:["1_436"], grp:["МАТ_2_1.2"], prep: ["Бахтина"], predm: "Мат. анализ"},
	{den: 1, para: 3, chzn: 2, aud:["1_227"], grp:["МАТ_2_1.3"], prep: ["Груздьев"], predm: "Диф. ур-я"},
	{den: 1, para: 4, chzn: 2, aud:["1_319"], grp:["МАТ_2_1.1"], prep: ["Шабров"], predm: "Мат. анализ"},
	{den: 1, para: 4, chzn: 2, aud:["1_436"], grp:["МАТ_2_1.2"], prep: ["Ляпина"], predm: "Диф. ур-я"},
	{den: 1, para: 4, chzn: 2, aud:["1_321"], grp:["МАТ_2_1.3"], prep: ["Бахтина"], predm: "Мат. анализ"},

	{den: 2, para: 0, chzn: 2, aud:["1_314"], grp:["МАТ_2_1.1","МАТ_2_1.2"], prep: ["Залыгаева"], predm: "Диф. геометрия"},
	{den: 2, para: 0, chzn: 2, aud:["1_501П"], grp:["МАТ_2_1.3"], prep: ["Ушаков"], predm: "ТП"},
	{den: 2, para: 1, chzn: 2, aud:["1б_501П"], grp:["МАТ_2_1.2"], prep: ["Ушаков"], predm: "ТП"},
	{den: 2, para: 1, chzn: 0, aud:["1_359"], grp:["МАТ_2_1.3"], prep: ["Залыгаева"], predm: "Диф. геометрия"},
	{den: 2, para: 1, chzn: 1, aud:["1_365"], grp:["МАТ_2_1.3"], prep: ["Залыгаева"], predm: "Диф. геометрия"},
	{den: 2, para: 1, chzn: 0, aud:["1_310"], grp:["МАТ_2_1.1"], prep: ["Леженина"], predm: "Диф. ур-я"},
	{den: 2, para: 1, chzn: 1, aud:["1_318"], grp:["МАТ_2_1.1"], prep: ["Леженина"], predm: "Диф. ур-я"},
	{den: 2, para: 2, chzn: 2, aud:["1_305"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3"], prep: ["Леженина"], predm: "Диф. ур-я"},
	{den: 2, para: 4, chzn: 2, aud:["1_Спортзал","2_Борц. зал"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3","МАТ_2_2","МАТ_2_3.1","МАТ_2_3.2","МАТ_2_3.3","МАТ_2_4.1","МАТ_2_4.2"], prep: ["Попов","Стрельникова"], predm: "Физкультура"},

	{den: 3, para: 0, chzn: 2, aud:["1_333"], grp:["МАТ_2_1.2"], prep: ["Бахтина"], predm: "Мат. анализ"},
	{den: 3, para: 1, chzn: 2, aud:["1_325"], grp:["МАТ_2_1.1"], prep: ["Кочетова"], predm: "Английский язык"},
	{den: 3, para: 1, chzn: 2, aud:["?"], grp:["МАТ_2_1.2"], prep: ["Орешина"], predm: "Английский язык"},
	{den: 3, para: 1, chzn: 2, aud:["1_333"], grp:["МАТ_2_1.3"], prep: ["Бахтина"], predm: "Мат. анализ"},
	{den: 3, para: 2, chzn: 2, aud:["1_430"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3"], prep: ["Курина"], predm: "Мат. анализ"},
	{den: 3, para: 3, chzn: 2, aud:["1_305"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3"], prep: ["Леженина"], predm: "фак. Доп. главы диф. ур-й"},
	{den: 3, para: 4, chzn: 2, aud:["1_310"], grp:["МАТ_2_1.1"], prep: ["Завгородний"], predm: "ТП"},
	{den: 3, para: 4, chzn: 2, aud:["1_325"], grp:["МАТ_2_1.3","МАТ_2_2","МАТ_2_3.3","МАТ_2_4.2"], prep: ["Бенедиктова"], predm: "Немецкий язык"},

	{den: 4, para: 1, chzn: 2, aud:["1_306"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3"], prep: ["Курина"], predm: "Мат. анализ"},
	{den: 4, para: 2, chzn: 2, aud:["1_437"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3"], prep: ["Гликлих"], predm: "Диф. геометрия и топология"},
	{den: 4, para: 3, chzn: 0, aud:["1_333"], grp:["МАТ_2_1.1"], prep: ["Шабров"], predm: "Мат. анализ"},
	{den: 4, para: 3, chzn: 1, aud:["1_340"], grp:["МАТ_2_1.1"], prep: ["Шабров"], predm: "Мат. анализ"},
	{den: 4, para: 3, chzn: 0, aud:["1_343"], grp:["МАТ_2_1.2"], prep: ["Ляпина"], predm: "Диф. ур-я"},
	{den: 4, para: 3, chzn: 1, aud:["1_436"], grp:["МАТ_2_1.2"], prep: ["Ляпина"], predm: "Диф. ур-я"},
	{den: 4, para: 3, chzn: 2, aud:["1б_504П"], grp:["МАТ_2_1.3"], prep: ["Груздьев"], predm: "Диф. ур-я"},
	{den: 4, para: 4, chzn: 2, aud:["1_227"], grp:["МАТ_2_1.1","МАТ_2_1.2","МАТ_2_1.3"], prep: ["Звягин"], predm: "Современные методы геометрии и анализа"},

	{den: 4, para: 4, chzn: 2, aud:["1_226"], grp:["МАТ_2_4.1"], prep: ["Звягин"], predm: "Современные методы геометрии и анализа"},

];

var conflicts=[];
conflicts[-1]=[];
